Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_fm.c
 *    Mcxnex (InfiniBand) HCA Driver Fault Management Routines
 *
 * [Mcxnex FM Implementation]
 *
 * Mcxnex FM recovers the system from a HW error situation and/or isolates a
 * HW error by calling the FMA acc handle check functions. (calling
 * ddi_fm_acc_err_get()) If a HW error is detected when either
 * ddi_fm_acc_err_get() is called, to determine whether or not the error is
 * transient, the I/O operation causing the error will retry up to three times.
 *
 * (Basic HW error recovery)
 *
 *        |
 *  .---->*
 *  |     |
 *  |   issue an I/O request via PIO
 *  |     |
 *  |     |
 *  |   check acc handle
 *  |     |
 *  |     |
 *  `--< a HW error detected && retry count < 3 >
 *        |
 *        v
 *
 * When a HW error is detected, to provide the error information for users to
 * isolate the faulted HW, Mcxnex FM issues Solaris FMA ereports as follows.
 *
 *  * PIO transient error
 *         invalid_state => unaffected
 *
 *  * PIO persistent error
 *         invalid_state => lost
 *
 *  * PIO fatal error
 *         invalid_state => lost => panic
 *
 *  * Mcxnex HCA firmware error
 *         invalid_state => degraded
 *
 *  * Other Mcxnex HCA specific errors
 *	   uncorrect => unaffected
 *		or
 *	   correct => unaffected
 *
 * (Restrictions)
 *
 * The current implementation has the following restrictions.
 *  * No runtime check/protection
 *  * No detach time check/protection
 *  * No DMA check/protection
 *
 * See the Mcxnex FMA portfolio in detail.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/sysmacros.h>
#include <sys/list.h>
#include <sys/modhash.h>

#include "mcxnex.h"

/*
 * Mcxnex driver has to disable its FM functionality
 * if this "fm_capable" variable is defined or has a value
 * in /kernel/drv/mcxnex.conf.
 */
static char *fm_cap = "fm-capable";	/* FM capability */

static mcxnex_hca_fm_t hca_fm;		/* Mcxnex HCA FM Structure */

static void i_hca_fm_ereport(dev_info_t *, int, char *);
static void i_hca_fm_init(struct i_hca_fm *);
static void i_hca_fm_fini(struct i_hca_fm *);
static int i_hca_regs_map_setup(struct i_hca_fm *, dev_info_t *, uint_t,
    caddr_t *, offset_t, offset_t, ddi_device_acc_attr_t *, ddi_acc_handle_t *);
static void i_hca_regs_map_free(struct i_hca_fm *, ddi_acc_handle_t *);
static int i_hca_pci_config_setup(struct i_hca_fm *, dev_info_t *,
    ddi_acc_handle_t *);
static void i_hca_pci_config_teardown(struct i_hca_fm *, ddi_acc_handle_t *);
static int i_hca_pio_start(dev_info_t *, struct i_hca_acc_handle *,
    mcxnex_test_t *);
static int i_hca_pio_end(dev_info_t *, struct i_hca_acc_handle *, int *,
    mcxnex_test_t *);
static struct i_hca_acc_handle *i_hca_get_acc_handle(struct i_hca_fm *,
    ddi_acc_handle_t);

/* forward declaration for mcxnex_fm_{init, fini}() */
#ifdef FMA_TEST
static void i_hca_test_init(mod_hash_t **, mod_hash_t **);
static void i_hca_test_fini(mod_hash_t **, mod_hash_t **);
#endif /* FMA_TEST */

/*
 * Mcxnex FM Functions
 *
 * These functions are based on the HCA FM common interface
 * defined below, but specific to the Mcxnex HCA FM capabilities.
 */

/*
 *  void
 *  mcxnex_hca_fm_init(mcxnex_state_t *state, mcxnex_hca_fm_t *hca)
 *
 *  Overview
 *      mcxnex_hca_fm_init() initializes the FM resources.
 *
 *  Argument
 *      state: pointer to state structure
 *      hca: pointer to FM structure
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      Can be called in user or kernel context only.
 */
static void
mcxnex_hca_fm_init(mcxnex_state_t *state, mcxnex_hca_fm_t *hca_fm)
{
	state->hs_fm_hca_fm = hca_fm;
	i_hca_fm_init((struct i_hca_fm *)hca_fm);
}


/*
 *  void
 *  mcxnex_hca_fm_fini(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_hca_fm_fini() releases the FM resources.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      Can be called in user or kernel context only.
 */
static void
mcxnex_hca_fm_fini(mcxnex_state_t *state)
{
	i_hca_fm_fini((struct i_hca_fm *)state->hs_fm_hca_fm);
	state->hs_fm_hca_fm = NULL;
}

/*
 *  void
 *  mcxnex_clr_state_nolock(mcxnex_state_t *state, int fm_state)
 *
 *  Overview
 *      mcxnex_clr_state() drops the specified state from Mcxnex FM state
 *      without the mutex locks.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *      fm_state: Mcxnex FM state, which is composed of:
 *		HCA_NO_FM	Hermom FM is not supported
 *		HCA_PIO_FM	PIO is fma-protected
 *		HCA_DMA_FM	DMA is fma-protected
 *		HCA_EREPORT_FM	FMA ereport is available
 *		HCA_ERRCB_FM	FMA error callback is supported
 *		HCA_ATTCH_FM	HCA FM attach mode
 *		HCA_RUNTM_FM	HCA FM runtime mode
 *
 *  Return value
 *  	Nothing
 *
 *  Caller's context
 *      mcxnex_clr_state() can be called in user, kernel, interrupt context
 *      or high interrupt context.
 */
void
mcxnex_clr_state_nolock(mcxnex_state_t *state, int fm_state)
{
	extern void membar_sync(void);

	state->hs_fm_state &= ~fm_state;
	membar_sync();
}


/*
 *  void
 *  mcxnex_clr_state(mcxnex_state_t *state, int fm_state)
 *
 *  Overview
 *      mcxnex_clr_state() drops the specified state from Mcxnex FM state.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *      fm_state: Mcxnex FM state, which is composed of:
 *		HCA_NO_FM	Hermom FM is not supported
 *		HCA_PIO_FM	PIO is fma-protected
 *		HCA_DMA_FM	DMA is fma-protected
 *		HCA_EREPORT_FM	FMA ereport is available
 *		HCA_ERRCB_FM	FMA error callback is supported
 *		HCA_ATTCH_FM	HCA FM attach mode
 *		HCA_RUNTM_FM	HCA FM runtime mode
 *
 *  Return value
 *  	Nothing
 *
 *  Caller's context
 *      mcxnex_clr_state() can be called in user, kernel or interrupt context.
 */
static void
mcxnex_clr_state(mcxnex_state_t *state, int fm_state)
{
	ASSERT(fm_state != HCA_NO_FM);

