Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
	mutex_enter(&state->hs_fm_lock);
	mcxnex_clr_state_nolock(state, fm_state);
	mutex_exit(&state->hs_fm_lock);
}


/*
 *  void
 *  mcxnex_set_state(mcxnex_state_t *state, int fm_state)
 *
 *  Overview
 *      mcxnex_set_state() sets Mcxnex FM state.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *      fm_state: Mcxnex FM state, which is composed of:
 *		HCA_NO_FM	Hermom FM is not supported
 *		HCA_PIO_FM	PIO is fma-protected
 *		HCA_DMA_FM	DMA is fma-protected
 *		HCA_EREPORT_FM	FMA ereport is available
 *		HCA_ERRCB_FM	FMA error callback is supported
 *		HCA_ATTCH_FM	HCA FM attach mode
 *		HCA_RUNTM_FM	HCA FM runtime mode
 *
 *  Return value
 *  	Nothing
 *
 *  Caller's context
 *      mcxnex_set_state() can be called in user, kernel or interrupt context.
 */
static void
mcxnex_set_state(mcxnex_state_t *state, int fm_state)
{
	extern void membar_sync(void);

	mutex_enter(&state->hs_fm_lock);
	if (fm_state == HCA_NO_FM) {
		state->hs_fm_state = HCA_NO_FM;
	} else {
		state->hs_fm_state |= fm_state;
	}
	membar_sync();
	mutex_exit(&state->hs_fm_lock);
}


/*
 *  int
 *  mcxnex_get_state(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_get_state() returns the current Mcxnex FM state.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *      fm_state: Mcxnex FM state, which is composed of:
 *		HCA_NO_FM	Hermom FM is not supported
 *		HCA_PIO_FM	PIO is fma-protected
 *		HCA_DMA_FM	DMA is fma-protected
 *		HCA_EREPORT_FM	FMA ereport is available
 *		HCA_ERRCB_FM	FMA error callback is supported
 *		HCA_ATTCH_FM	HCA FM attach mode
 *		HCA_RUNTM_FM	HCA FM runtime mode
 *
 *  Caller's context
 *      mcxnex_get_state() can be called in user, kernel or interrupt context.
 */
int
mcxnex_get_state(mcxnex_state_t *state)
{
	return (state->hs_fm_state);
}


/*
 *  void
 *  mcxnex_fm_init(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_fm_init() is an FM initialization function which registers
 *      some FMA functions such as the ereport and the acc check capabilities.
 *      If the "fm_disable" property in /kernel/drv/mcxnex.conf is
 *      defined (and/or its value is set), then the FM capabilities will
 *      drop, and only the default capabilities (the ereport and error callback
 *      capabilities) are available (and the action against HW errors is
 *      issuing an ereport then panicking the system).
 *
 *  Argument
 *      state: pointer to state structure
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      Can be called in user or kernel context only.
 */
void
mcxnex_fm_init(mcxnex_state_t *state)
{
	ddi_iblock_cookie_t iblk;

	/*
	 * Check the "fm_disable" property. If it's defined,
	 * use the Solaris FMA default action for Mcxnex.
	 */
	if (ddi_getprop(DDI_DEV_T_NONE, state->hs_dip, DDI_PROP_DONTPASS,
	    "fm_disable", 0) != 0) {
		state->hs_fm_disable = 1;
	}

	/* If hs_fm_diable is set, then skip the rest */
	if (state->hs_fm_disable) {
		mcxnex_set_state(state, HCA_NO_FM);
		return;
	}

	/* Set the Mcxnex FM attach mode */
	mcxnex_set_state(state, HCA_ATTCH_FM);

	/* Initialize the Solaris FMA capabilities for the Mcxnex FM support */
	state->hs_fm_capabilities = ddi_prop_get_int(DDI_DEV_T_ANY,
	    state->hs_dip, DDI_PROP_DONTPASS, fm_cap,
	    DDI_FM_EREPORT_CAPABLE | DDI_FM_ACCCHK_CAPABLE);

	/*
	 * The Mcxnex FM uses the ereport and acc check capabilites only,
	 * but both of them should be available. If either is not, turn
	 * hs_fm_disable on and behave in the same way as the "fm_diable"
	 * property is set.
	 */
	if (state->hs_fm_capabilities !=
	    (DDI_FM_EREPORT_CAPABLE | DDI_FM_ACCCHK_CAPABLE)) {
		state->hs_fm_disable = 1;
		mcxnex_set_state(state, HCA_NO_FM);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "Mcxnex FM capability fails");
		return;
	}

	/* Initialize the HCA FM resources */
	mcxnex_hca_fm_init(state, &hca_fm);

	/* Initialize the fm state lock */
	mutex_init(&state->hs_fm_lock, NULL, MUTEX_DRIVER, NULL);

	/* Register the capabilities with the IO fault services */
	ddi_fm_init(state->hs_dip, &state->hs_fm_capabilities, &iblk);

	/* Set up the pci ereport capabilities if the ereport is capable */
	if (DDI_FM_EREPORT_CAP(state->hs_fm_capabilities)) {
		pci_ereport_setup(state->hs_dip);
	}

	/* Set the Mcxnex FM state */
	mcxnex_set_state(state, HCA_PIO_FM | HCA_EREPORT_FM);

#ifdef FMA_TEST
	i_hca_test_init(&state->hs_fm_test_hash, &state->hs_fm_id_hash);
#endif /* FMA_TEST */
}


/*
 *  void
 *  mcxnex_fm_fini(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_fm_fini() is a FM finalization function which de-registers
 *      Solaris FMA functions set to the device.
 *
 *  Argument
 *      state: pointer to state structure
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      mcxnex_fm_fini() can be called in user or kernel context only.
 */
void
mcxnex_fm_fini(mcxnex_state_t *state)
{
	/*
	 * If mcxnex_fm_diable is set or there is no FM service provided,
	 * then skip the rest.
	 */
	if (state->hs_fm_disable || mcxnex_get_state(state) == HCA_NO_FM) {
		return;
	}

	ASSERT(!(mcxnex_get_state(state) & HCA_ERRCB_FM));

#ifdef FMA_TEST
	i_hca_test_fini(&state->hs_fm_test_hash, &state->hs_fm_id_hash);
#endif /* FMA_TEST */

	/* Set the Mcxnex FM state to no support */
	mcxnex_set_state(state, HCA_NO_FM);

	/* Release HCA FM resources */
	mcxnex_hca_fm_fini(state);

	/*
	 * Release any resources allocated by pci_ereport_setup()
	 */
	if (DDI_FM_EREPORT_CAP(state->hs_fm_capabilities)) {
		pci_ereport_teardown(state->hs_dip);
	}

	/* De-register the Mcxnex FM from the IO fault services */
	ddi_fm_fini(state->hs_dip);
}


/*
 *  int
 *  mcxnex_fm_ereport_init(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_fm_ereport_init() changes the Mcxnex FM state to the ereport
 *      only mode during the driver attach.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *      DDI_SUCCESS
 *      DDI_FAILURE
 *
 *  Caller's context
 *      mcxnex_fm_ereport_init() can be called in user or kernel context only.
 */
int
mcxnex_fm_ereport_init(mcxnex_state_t *state)
{
	ddi_iblock_cookie_t iblk;
	mcxnex_cfg_profile_t *cfgprof;
	mcxnex_hw_querydevlim_t	*devlim;
	mcxnex_rsrc_hw_entry_info_t entry_info;
	mcxnex_rsrc_pool_info_t	*rsrc_pool;
	uint64_t offset, num, max, num_prealloc;
	ddi_device_acc_attr_t dev_attr = {
		DDI_DEVICE_ATTR_V0,
		DDI_STRUCTURE_LE_ACC,
		DDI_STRICTORDER_ACC,
		DDI_DEFAULT_ACC
	};
	char *rsrc_name;
	extern void membar_sync(void);

	/* Stop the poll thread while the FM state is being changed */
	state->hs_fm_poll_suspend = B_TRUE;
	membar_sync();

