Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
	/*
	 * Disable the Mcxnex interrupt after the interrupt capability flag
	 * is checked.
	 */
	if (state->hs_intrmsi_cap & DDI_INTR_FLAG_BLOCK) {
		if (ddi_intr_block_disable
		    (&state->hs_intrmsi_hdl[0], 1) != DDI_SUCCESS) {
			return (DDI_FAILURE);
		}
	} else {
		if (ddi_intr_disable
		    (state->hs_intrmsi_hdl[0]) != DDI_SUCCESS) {
			return (DDI_FAILURE);
		}
	}

	/*
	 * Release any resources allocated by pci_ereport_setup()
	 */
	if (DDI_FM_EREPORT_CAP(state->hs_fm_capabilities)) {
		pci_ereport_teardown(state->hs_dip);
	}

	/* De-register the Mcxnex FM from the IO fault services */
	ddi_fm_fini(state->hs_dip);

	/* Re-initialize fm ereport with the ereport only */
	state->hs_fm_capabilities = ddi_prop_get_int(DDI_DEV_T_ANY,
	    state->hs_dip, DDI_PROP_DONTPASS, fm_cap,
	    DDI_FM_EREPORT_CAPABLE);

	/*
	 * Now that the Mcxnex FM uses the ereport capability only,
	 * If it's not set, turn hs_fm_disable on and behave in the
	 * same way as the "fm_diable" property is set.
	 */
	if (state->hs_fm_capabilities != DDI_FM_EREPORT_CAPABLE) {
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "Mcxnex FM ereport fails (ereport mode)");
		goto error;
	}

	/* Re-register the ereport capability with the IO fault services */
	ddi_fm_init(state->hs_dip, &state->hs_fm_capabilities, &iblk);

	/* Initialize the pci ereport capabilities if the ereport is capable */
	if (DDI_FM_EREPORT_CAP(state->hs_fm_capabilities)) {
		pci_ereport_setup(state->hs_dip);
	}

	/* Setup for PCI config read/write of HCA device */
	if (pci_config_setup(state->hs_dip, &state->hs_reg_pcihdl) !=
	    DDI_SUCCESS) {
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "PCI config mapping fails (ereport mode)");
		goto error;
	}

	/* Allocate the regular access handle for MSI-X tables */
	if (ddi_regs_map_setup(state->hs_dip, state->hs_msix_tbl_rnumber,
	    (caddr_t *)&state->hs_msix_tbl_addr, state->hs_msix_tbl_offset,
	    state->hs_msix_tbl_size, &dev_attr,
	    &state->hs_reg_msix_tblhdl) != DDI_SUCCESS) {
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "MSI-X Table mapping fails (ereport mode)");
		goto error;
	}

	/* Allocate the regular access handle for MSI-X PBA */
	if (ddi_regs_map_setup(state->hs_dip, state->hs_msix_pba_rnumber,
	    (caddr_t *)&state->hs_msix_pba_addr, state->hs_msix_pba_offset,
	    state->hs_msix_pba_size, &dev_attr,
	    &state->hs_reg_msix_pbahdl) != DDI_SUCCESS) {
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "MSI-X PBA mapping fails (ereport mode)");
		goto error;
	}

	/* Allocate the regular access handle for Mcxnex CMD I/O space */
	if (ddi_regs_map_setup(state->hs_dip, MCXNEX_CMD_BAR,
	    &state->hs_reg_cmd_baseaddr, 0, 0, &state->hs_reg_accattr,
	    &state->hs_reg_cmdhdl) != DDI_SUCCESS) {
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "CMD_BAR mapping fails (ereport mode)");
		goto error;
	}

	/* Reset the host command register */
	state->hs_cmd_regs.hcr = (mcxnex_hw_hcr_t *)
	    ((uintptr_t)state->hs_reg_cmd_baseaddr + MCXNEX_CMD_HCR_OFFSET);

	/* Reset the software reset register */
	state->hs_cmd_regs.sw_reset = (uint32_t *)
	    ((uintptr_t)state->hs_reg_cmd_baseaddr +
	    MCXNEX_CMD_SW_RESET_OFFSET);

	/* Reset the software reset register semaphore */
	state->hs_cmd_regs.sw_semaphore = (uint32_t *)
	    ((uintptr_t)state->hs_reg_cmd_baseaddr +
	    MCXNEX_CMD_SW_SEMAPHORE_OFFSET);

	/* Calculate the clear interrupt register offset */
	offset = state->hs_fw.clr_intr_offs & MCXNEX_CMD_OFFSET_MASK;

	/* Reset the clear interrupt address */
	state->hs_cmd_regs.clr_intr = (uint64_t *)
	    (uintptr_t)(state->hs_reg_cmd_baseaddr + offset);

	/* Reset the internal error buffer address */
	state->hs_cmd_regs.fw_err_buf = (uint32_t *)(uintptr_t)
	    (state->hs_reg_cmd_baseaddr + state->hs_fw.error_buf_addr);

	/* Check if the blue flame is enabled, and set the offset value */
	if (state->hs_devlim.blu_flm) {
		offset = (uint64_t)1 <<
		    (state->hs_devlim.log_max_uar_sz + 20);
	} else {
		offset = 0;
	}

	/* Allocate the regular access handle for Mcxnex UAR I/O space */
	if (ddi_regs_map_setup(state->hs_dip, MCXNEX_UAR_BAR,
	    &state->hs_reg_uar_baseaddr, 0, offset,
	    &state->hs_reg_accattr, &state->hs_reg_uarhdl) != DDI_SUCCESS) {
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "UAR BAR mapping fails (ereport mode)");
		goto error;
	}

	/* Drop the Mcxnex FM Attach Mode */
	mcxnex_clr_state(state, HCA_ATTCH_FM);

	/* Set the Mcxnex FM Runtime Mode */
	mcxnex_set_state(state, HCA_RUNTM_FM);

	/* Free up Mcxnex UAR page #1 */
	mcxnex_rsrc_free(state, &state->hs_uarkpg_rsrc);

	/* Free up the UAR pool */
	entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_UARPG];
	mcxnex_rsrc_hw_entries_fini(state, &entry_info);

	/* Re-allocate the UAR pool */
	cfgprof = state->hs_cfg_profile;
	devlim	= &state->hs_devlim;
	num			  = ((uint64_t)1 << cfgprof->cp_log_num_uar);
	max			  = num;
	num_prealloc		  = max(devlim->num_rsvd_uar, 128);
	rsrc_pool		  = &state->hs_rsrc_hdl[MCXNEX_UARPG];
	rsrc_pool->rsrc_type	  = MCXNEX_UARPG;
	rsrc_pool->rsrc_loc	  = MCXNEX_IN_UAR;
	rsrc_pool->rsrc_pool_size = (num << PAGESHIFT);
	rsrc_pool->rsrc_shift	  = PAGESHIFT;
	rsrc_pool->rsrc_quantum	  = (uint_t)PAGESIZE;
	rsrc_pool->rsrc_align	  = PAGESIZE;
	rsrc_pool->rsrc_state	  = state;
	rsrc_pool->rsrc_start	  = (void *)state->hs_reg_uar_baseaddr;
	rsrc_name = (char *)kmem_zalloc(MCXNEX_RSRC_NAME_MAXLEN, KM_SLEEP);
	MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_UAR_PAGE_VMEM_RUNTM);
	entry_info.hwi_num	  = num;
	entry_info.hwi_max	  = max;
	entry_info.hwi_prealloc	  = num_prealloc;
	entry_info.hwi_rsrcpool	  = rsrc_pool;
	entry_info.hwi_rsrcname	  = rsrc_name;
	if (mcxnex_rsrc_hw_entries_init(state, &entry_info) != DDI_SUCCESS) {
		kmem_free(rsrc_name, MCXNEX_RSRC_NAME_MAXLEN);
		goto error;
	}
	kmem_free(rsrc_name, MCXNEX_RSRC_NAME_MAXLEN);

	/* Re-allocate the kernel UAR page */
	if (mcxnex_rsrc_alloc(state, MCXNEX_UARPG, 1, DDI_SLEEP,
	    &state->hs_uarkpg_rsrc) != DDI_SUCCESS) {
		goto error;
	}

	/* Setup pointer to kernel UAR page */
	state->hs_uar = (mcxnex_hw_uar_t *)state->hs_uarkpg_rsrc->hr_addr;

	/* Now drop the the Mcxnex PIO FM */
	mcxnex_clr_state(state, HCA_PIO_FM);

	/* Release the MSI-X Table access handle */
	if (state->hs_fm_msix_tblhdl) {
		mcxnex_regs_map_free(state, &state->hs_fm_msix_tblhdl);
		state->hs_fm_msix_tblhdl = NULL;
	}

	/* Release the MSI-X PBA access handle */
	if (state->hs_fm_msix_pbahdl) {
		mcxnex_regs_map_free(state, &state->hs_fm_msix_pbahdl);
		state->hs_fm_msix_pbahdl = NULL;
	}

