Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
	/* Release the pci config space access handle */
	if (state->hs_fm_pcihdl) {
		mcxnex_regs_map_free(state, &state->hs_fm_pcihdl);
		state->hs_fm_pcihdl = NULL;
	}

	/* Release the cmd protected access handle */
	if (state->hs_fm_cmdhdl) {
		mcxnex_regs_map_free(state, &state->hs_fm_cmdhdl);
		state->hs_fm_cmdhdl = NULL;
	}

	/* Release the uar fma-protected access handle */
	if (state->hs_fm_uarhdl) {
		mcxnex_regs_map_free(state, &state->hs_fm_uarhdl);
		state->hs_fm_uarhdl = NULL;
	}

	/* Enable the Mcxnex interrupt again */
	if (state->hs_intrmsi_cap & DDI_INTR_FLAG_BLOCK) {
		if (ddi_intr_block_enable
		    (&state->hs_intrmsi_hdl[0], 1) != DDI_SUCCESS) {
			return (DDI_FAILURE);
		}
	} else {
		if (ddi_intr_enable
		    (state->hs_intrmsi_hdl[0]) != DDI_SUCCESS) {
			return (DDI_FAILURE);
		}
	}

	/* Restart the poll thread */
	state->hs_fm_poll_suspend = B_FALSE;

	return (DDI_SUCCESS);

error:
	/* Enable the Mcxnex interrupt again */
	if (state->hs_intrmsi_cap & DDI_INTR_FLAG_BLOCK) {
		(void) ddi_intr_block_enable(&state->hs_intrmsi_hdl[0], 1);
	} else {
		(void) ddi_intr_enable(state->hs_intrmsi_hdl[0]);
	}
	return (DDI_FAILURE);
}


/*
 *  int
 *  mcxnex_regs_map_setup(mcxnex_state_t *state, uint_t rnumber, caddr_t *addrp,
 *	offset_t offset, offset_t len, ddi_device_acc_attr_t *accattrp,
 *	ddi_acc_handle_t *handle)
 *
 *  Overview
 *      This is a wrapper function of i_hca_regs_map_setup() for Mcxnex FM so
 *      that it calls i_hca_regs_map_setup() inside after it checks the
 *      "fm_disable" configuration property. If the "fm_disable" is described
 *      in /kernel/drv/mcxnex.conf, the function calls ddi_regs_map_setup()
 *      directly instead.
 *      See i_hca_regs_map_setup() in detail.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *      rnumber: index number to the register address space set
 *      addrp: platform-dependent value (same as ddi_regs_map_setup())
 *      offset: offset into the register address space
 *      len: address space length to be mapped
 *      accattrp: pointer to device access attribute structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *
 *  Return value
 *      ddi function status value which are:
 *      	DDI_SUCCESS
 *      	DDI_FAILURE
 *      	DDI_ME_RNUMBER_RNGE
 *      	DDI_REGS_ACC_CONFLICT
 *
 *  Caller's context
 *      mcxnex_regs_map_setup() can be called in user or kernel context only.
 */
int
mcxnex_regs_map_setup(mcxnex_state_t *state, uint_t rnumber, caddr_t *addrp,
	offset_t offset, offset_t len, ddi_device_acc_attr_t *accattrp,
	ddi_acc_handle_t *handle)
{
	if (state->hs_fm_disable) {
		return (ddi_regs_map_setup(state->hs_dip, rnumber, addrp,
		    offset, len, accattrp, handle));
	} else {
		return (i_hca_regs_map_setup(state->hs_fm_hca_fm, state->hs_dip,
		    rnumber, addrp, offset, len, accattrp, handle));
	}
}


/*
 *  void
 *  mcxnex_regs_map_free(mcxnex_state_t *state, ddi_acc_handle_t *handlep)
 *
 *  Overview
 *      This is a wrapper function of i_hca_regs_map_free() for Mcxnex FM so
 *      that it calls i_hca_regs_map_free() inside after it checks the
 *      "fm_disable" configuration property. If the "fm_disable" is described
 *      in /kernel/drv/mcxnex.conf, the function calls ddi_regs_map_fre()
 *      directly instead.  See i_hca_regs_map_free() in detail.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      mcxnex_regs_map_free() can be called in user or kernel context only.
 *
 *  Note that the handle passed to mcxnex_regs_map_free() is NULL-cleared
 *  after this function is called.
 */
void
mcxnex_regs_map_free(mcxnex_state_t *state, ddi_acc_handle_t *handle)
{
	if (state->hs_fm_disable) {
		ddi_regs_map_free(handle);
		*handle = NULL;
	} else {
		i_hca_regs_map_free(state->hs_fm_hca_fm, handle);
	}
}


/*
 *  int
 *  mcxnex_pci_config_setup(mcxnex_state_t *state, ddi_acc_handle_t *handle)
 *
 *  Overview
 *      This is a wrapper function of i_hca_pci_config_setup() for Mcxnex FM so
 *      that it calls i_hca_pci_config_setup() inside after it checks the
 *      "fm-disable" configuration property. If the "fm_disable" is described
 *      in /kernel/drv/mcxnex.conf, the function calls pci_config_setup()
 *      directly instead. See i_hca_pci_config_setup() in detail.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *
 *  Return value
 *      ddi function status value which are:
 *      	DDI_SUCCESS
 *      	DDI_FAILURE
 *
 *  Caller's context
 *      mcxnex_pci_config_setup() can be called in user or kernel context only.
 */
int
mcxnex_pci_config_setup(mcxnex_state_t *state, ddi_acc_handle_t *handle)
{
	if (state->hs_fm_disable) {
		return (pci_config_setup(state->hs_dip, handle));
	} else {
		/* Check Mcxnex FM and Solaris FMA capability flags */
		ASSERT((mcxnex_get_state(state) & HCA_PIO_FM &&
		    DDI_FM_ACC_ERR_CAP(ddi_fm_capable(state->hs_dip))) ||
		    (!(mcxnex_get_state(state) & HCA_PIO_FM) &&
		    !DDI_FM_ACC_ERR_CAP(ddi_fm_capable(state->hs_dip))));
		return (i_hca_pci_config_setup(state->hs_fm_hca_fm,
		    state->hs_dip, handle));
	}
}


/*
 *  void
 *  mcxnex_pci_config_teardown(mcxnex_state_t *state, ddi_acc_handle_t *handle)
 *
 *  Overview
 *      This is a wrapper function of i_hca_pci_config_teardown() for Mcxnex
 *      FM so that it calls i_hca_pci_config_teardown() inside after it checks
 *      the "fm-disable" configuration property. If the "fm_disable" is
 *      described in /kernel/drv/mcxnex.conf, the function calls
 *      pci_config_teardown() directly instead.
 *      See i_hca_pci_config_teardown() in detail.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      mcxnex_pci_config_teardown() can be called in user or kernel context
 *      only.
 */
void
mcxnex_pci_config_teardown(mcxnex_state_t *state, ddi_acc_handle_t *handle)
{
	if (state->hs_fm_disable) {
		pci_config_teardown(handle);
		*handle = NULL;
	} else {
		i_hca_pci_config_teardown(state->hs_fm_hca_fm, handle);
	}
}


