Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
/*
 *  boolean_t
 *  mcxnex_init_failure(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_init_failure() tells if HW errors are detected in
 *      the Mcxnex driver attach.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *  	B_TRUE		HW errors detected during attach
 *  	B_FALSE		No HW errors during attach
 *
 *  Caller's context
 *      mcxnex_init_failure() can be called in user, kernel, interrupt
 *      context or high interrupt context.
 */
boolean_t
mcxnex_init_failure(mcxnex_state_t *state)
{
	ddi_acc_handle_t hdl;
	ddi_fm_error_t derr;

	if (!(mcxnex_get_state(state) & HCA_PIO_FM))
		return (B_FALSE);

	/* check if fatal errors occur during attach */
	if (state->hs_fm_async_fatal)
		return (B_TRUE);

	hdl = mcxnex_get_uarhdl(state);
	/* Get the PIO error against UAR I/O space */
	ddi_fm_acc_err_get(hdl, &derr, DDI_FME_VERSION);
	if (derr.fme_status != DDI_FM_OK) {
		return (B_TRUE);
	}

	hdl = mcxnex_get_cmdhdl(state);
	/* Get the PIO error againsts CMD I/O space */
	ddi_fm_acc_err_get(hdl, &derr, DDI_FME_VERSION);
	if (derr.fme_status != DDI_FM_OK) {
		return (B_TRUE);
	}

	return (B_FALSE);
}


/*
 *  void
 *  mcxnex_fm_ereport(mcxnex_state_t *state, int type, int detail)
 *
 *  Overview
 *      mcxnex_fm_ereport() is a Mcxnex FM ereport function used
 *      to issue a Solaris FMA ereport. See Mcxnex FM comments at the
 *      beginning of this file in detail.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *      type: error type
 *		HCA_SYS_ERR	FMA reporting HW error
 *		HCA_IBA_ERR	HCA specific HW error
 *      detail: HW error hint implying which ereport is issued
 * 		HCA_ERR_TRANSIENT	HW transienet error
 * 		HCA_ERR_NON_FATAL	HW persistent error
 * 		HCA_ERR_FATAL		HW fatal error
 * 		HCA_ERR_SRV_LOST	IB service lost due to HW error
 * 		HCA_ERR_DEGRADED	Mcxnex driver and/or uDAPL degraded
 * 					due to HW error
 * 		HCA_ERR_IOCTL		HW error detected in user conetxt
 * 					(especially in ioctl())
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      mcxnex_fm_ereport() can be called in user, kernel, interrupt context
 *      or high interrupt context.
 */
void
mcxnex_fm_ereport(mcxnex_state_t *state, int type, int detail)
{
	/*
	 * If mcxnex_fm_diable is set or there is no FM ereport service
	 * provided, then skip the rest.
	 */
	if (state->hs_fm_disable ||
	    !(mcxnex_get_state(state) & HCA_EREPORT_FM)) {
		return;
	}

	switch (type) {

	case HCA_SYS_ERR:
		switch (detail) {
		case HCA_ERR_TRANSIENT:
		case HCA_ERR_IOCTL:
			ddi_fm_service_impact(state->hs_dip,
			    DDI_SERVICE_UNAFFECTED);
			break;
		case HCA_ERR_NON_FATAL:
			/* Nothing */
			break;
		case HCA_ERR_SRV_LOST:
			ddi_fm_service_impact(state->hs_dip,
			    DDI_SERVICE_LOST);
			break;
		case HCA_ERR_DEGRADED:
			switch (state->hs_fm_degraded_reason) {
			case HCA_FW_CORRUPT:
				i_hca_fm_ereport(state->hs_dip, type,
				    DDI_FM_DEVICE_FW_CORRUPT);
				break;
			case HCA_FW_MISMATCH:
				i_hca_fm_ereport(state->hs_dip, type,
				    DDI_FM_DEVICE_FW_MISMATCH);
				break;
			case HCA_FW_MISC:
			default:
				i_hca_fm_ereport(state->hs_dip, type,
				    DDI_FM_DEVICE_INTERN_UNCORR);
				break;
			}
			ddi_fm_service_impact(state->hs_dip,
			    DDI_SERVICE_DEGRADED);
			break;
		case HCA_ERR_FATAL:
			ddi_fm_service_impact(state->hs_dip,
			    DDI_SERVICE_LOST);
			state->hs_fm_async_fatal = B_TRUE;
			break;
		default:
			cmn_err(CE_WARN, "mcxnex_fm_ereport: Unknown error. "
			    "type = %d, detail = %d\n.", type, detail);
		}
		break;

	case HCA_IBA_ERR:
		switch (detail) {
		case HCA_ERR_TRANSIENT:
			i_hca_fm_ereport(state->hs_dip, type,
			    DDI_FM_DEVICE_INTERN_UNCORR);
			ddi_fm_service_impact(state->hs_dip,
			    DDI_SERVICE_UNAFFECTED);
			break;
		case HCA_ERR_SRV_LOST:
			cmn_err(CE_WARN, "mcxnex_fm_ereport: not supported "
			    "error. type = %d, detail = %d\n.", type, detail);
			break;
		case HCA_ERR_DEGRADED:
			switch (state->hs_fm_degraded_reason) {
			case HCA_FW_CORRUPT:
				i_hca_fm_ereport(state->hs_dip, type,
				    DDI_FM_DEVICE_FW_CORRUPT);
				break;
			case HCA_FW_MISMATCH:
				i_hca_fm_ereport(state->hs_dip, type,
				    DDI_FM_DEVICE_FW_MISMATCH);
				break;
			case HCA_FW_MISC:
			default:
				i_hca_fm_ereport(state->hs_dip, type,
				    DDI_FM_DEVICE_INTERN_UNCORR);
				break;
			}
			ddi_fm_service_impact(state->hs_dip,
			    DDI_SERVICE_DEGRADED);
			break;
		case HCA_ERR_IOCTL:
		case HCA_ERR_NON_FATAL:
			i_hca_fm_ereport(state->hs_dip, type,
			    DDI_FM_DEVICE_INTERN_UNCORR);
			ddi_fm_service_impact(state->hs_dip,
			    DDI_SERVICE_UNAFFECTED);
			break;
		case HCA_ERR_FATAL:
			if (mcxnex_get_state(state) & HCA_PIO_FM) {
				if (servicing_interrupt()) {
					atomic_inc_32(&state->
					    hs_fm_async_errcnt);
				} else {
					i_hca_fm_ereport(state->hs_dip, type,
					    DDI_FM_DEVICE_INTERN_UNCORR);
					ddi_fm_service_impact(state->hs_dip,
					    DDI_SERVICE_LOST);
				}
				state->hs_fm_async_fatal = B_TRUE;
			} else {
				i_hca_fm_ereport(state->hs_dip, type,
				    DDI_FM_DEVICE_INTERN_UNCORR);
				ddi_fm_service_impact(state->hs_dip,
				    DDI_SERVICE_LOST);
				cmn_err(CE_PANIC,
				    "Mcxnex Fatal Internal Error. "
				    "Mcxnex state=0x%p", (void *)state);
			}
			break;
		default:
			cmn_err(CE_WARN, "mcxnex_fm_ereport: Unknown error. "
			    "type = %d, detail = %d\n.", type, detail);
		}
		break;

	default:
		cmn_err(CE_WARN, "mcxnex_fm_ereport: Unknown type "
		    "type = %d, detail = %d\n.", type, detail);
		break;
	}
}


/*
 *  uchar_t
 *  mcxnex_devacc_attr_version(mcxnex_state_t *)
 *
 *  Overview
 *      mcxnex_devacc_attr_version() returns the ddi device attribute
 *      version.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *      dev_acc_attr_version value
 *      	DDI_DEVICE_ATTR_V0	Mcxnex FM disabled
 *      	DDI_DEVICE_ATTR_V1	Mcxnex FM enabled
 *
 *  Caller's context
 *      mcxnex_devacc_attr_version() can be called in user, kernel, interrupt
 *      context or high interrupt context.
 */
ushort_t
mcxnex_devacc_attr_version(mcxnex_state_t *state)
{
	if (state->hs_fm_disable) {
		return (DDI_DEVICE_ATTR_V0);
	} else {
		return (DDI_DEVICE_ATTR_V1);
	}
}


