Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
/*
 *  uchar_t
 *  mcxnex_devacc_attr_access(mcxnex_state_t *)
 *
 *  Overview
 *      mcxnex_devacc_attr_access() returns devacc_attr_access error
 *      protection types.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *      dev_acc_attr_access error protection type
 *      	DDI_DEFAULT_ACC		Mcxnex FM disabled for PIO
 *      	DDI_FLAGERR_ACC		Mcxnex FM enabled for PIO
 *
 *  Caller's context
 *      mcxnex_devacc_attr_access() can be called in user, kernel, interrupt
 *      context or high interrupt context.
 */
uchar_t
mcxnex_devacc_attr_access(mcxnex_state_t *state)
{
	if (state->hs_fm_disable) {
		return (DDI_DEFAULT_ACC);
	} else {
		return (DDI_FLAGERR_ACC);
	}
}


/*
 *  int
 *  mcxnex_PIO_start(mcxnex_state_t *state, ddi_acc_handle_t handle,
 *      mcxnex_test_t *tst)
 *
 *  Overview
 *      mcxnex_PIO_start() should be called before Mcxnex driver issues PIOs
 *      against I/O space. If Mcxnex FM is disabled, this function returns
 *      HCA_PIO_OK always. See i_hca_pio_start() in detail.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *      tst: pointer to HCA FM function test structure. If the structure
 *           is not used, the NULL value must be passed instead.
 *
 *  Return value
 *  	error status showing whether or not this error can retry
 *	HCA_PIO_OK		No HW errors
 *	HCA_PIO_TRANSIENT	This error could be transient
 *	HCA_PIO_PERSISTENT	This error is persistent
 *
 *  Caller's context
 *      mcxnex_PIO_start() can be called in user, kernel or interrupt context.
 */
int
mcxnex_PIO_start(mcxnex_state_t *state, ddi_acc_handle_t handle,
    mcxnex_test_t *tst)
{
	if (state->hs_fm_disable) {
		return (HCA_PIO_OK);
	} else {
		struct i_hca_acc_handle *handlep =
		    i_hca_get_acc_handle(state->hs_fm_hca_fm, handle);
		ASSERT(handlep != NULL);
		return (i_hca_pio_start(state->hs_dip, handlep, tst));
	}
}


/*
 *  int
 *  mcxnex_PIO_end(mcxnex_state_t *state, ddi_acc_handle_t handle, int *cnt,
 *      mcxnex_test_t *tst)
 *
 *  Overview
 *      mcxnex_PIO_end() should be called after Mcxnex driver issues PIOs
 *      against I/O space. If Mcxnex FM is disabled, this function returns
 *      HCA_PIO_OK always. See i_hca_pio_end() in detail.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *	cnt: pointer to the counter variable which holds the nubmer of retry
 *	     (HCA_PIO_RETRY_CNT) when a HW error is detected.
 *      tst: pointer to HCA FM function test structure. If the structure
 *           is not used, the NULL value must be passed instead.
 *
 *  Return value
 *  	error status showing whether or not this error can retry
 *	HCA_PIO_OK		No HW errors
 *	HCA_PIO_TRANSIENT	This error could be transient
 *	HCA_PIO_PERSISTENT	This error is persistent
 *
 *  Caller's context
 *      mcxnex_PIO_end() can be called in user, kernel or interrupt context.
 */
int
mcxnex_PIO_end(mcxnex_state_t *state, ddi_acc_handle_t handle, int *cnt,
    mcxnex_test_t *tst)
{
	if (state->hs_fm_disable) {
		return (HCA_PIO_OK);
	} else {
		struct i_hca_acc_handle *handlep =
		    i_hca_get_acc_handle(state->hs_fm_hca_fm, handle);
		ASSERT(handlep != NULL);
		return (i_hca_pio_end(state->hs_dip, handlep, cnt, tst));
	}
}


/*
 *  ddi_acc_handle_t
 *  mcxnex_get_cmdhdl(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_get_cmdhdl() returns either the fma-protected access handle or
 *      the regular ddi-access handle depending on the Mcxnex FM state for
 *      Mcxnex command I/O space.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *  	the access handle for pio requests
 *
 *  Caller's context
 *      mcxnex_get_cmdhdl() can be called in user, kernel, interrupt context
 *      or high interrupt context.
 */
ddi_acc_handle_t
mcxnex_get_cmdhdl(mcxnex_state_t *state)
{
	return (state->hs_fm_disable || mcxnex_get_state(state) & HCA_PIO_FM ?
	    state->hs_fm_cmdhdl : state->hs_reg_cmdhdl);
}


/*
 *  ddi_acc_handle_t
 *  mcxnex_get_uarhdl(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_get_uarhdl() returns either the fma-protected access handle or
 *      the regular ddi-access handle depending on the Mcxnex FM state for
 *      Mcxnex UAR I/O space.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *  	the access handle for pio requests
 *
 *  Caller's context
 *      mcxnex_get_uarhdl() can be called in user, kernel, interrupt context
 *      or high interrupt context.
 */
ddi_acc_handle_t
mcxnex_get_uarhdl(mcxnex_state_t *state)
{
	return (state->hs_fm_disable || mcxnex_get_state(state) & HCA_PIO_FM ?
	    state->hs_fm_uarhdl : state->hs_reg_uarhdl);
}


/*
 *  ddi_acc_handle_t
 *  mcxnex_rsrc_alloc_uarhdl(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_rsrc_alloc_uarhdl() returns either the fma-protected access
 *      handle or the regular ddi-access handle depending on the Mcxnex FM
 *      state for Mcxnex UAR I/O space as well as mcxnex_get_uarhdl(), but
 *      this function is dedicated to the UAR resource allocator.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *  	the access handle for pio requests
 *
 *  Caller's context
 *      mcxnex_rsrc_alloc_uarhdl() can be called in user, kernel, interrupt
 *      or high interrupt context.
 */
ddi_acc_handle_t
mcxnex_rsrc_alloc_uarhdl(mcxnex_state_t *state)
{
	return (state->hs_fm_disable || mcxnex_get_state(state) & HCA_ATTCH_FM ?
	    state->hs_fm_uarhdl : state->hs_reg_uarhdl);
}

/*
 *  ddi_acc_handle_t
 *  mcxnex_get_pcihdl(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_get_pcihdl() returns either the fma-protected access
 *      handle or the regular ddi-access handle to access the PCI config
 *      space. Whether or not which handle is returned at the moment depends
 *      on the Mcxnex FM state.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *  	the access handle to PCI config space
 *
 *  Caller's context
 *      mcxnex_get_pcihdl() can be called in user, kernel, interrupt
 *      or high interrupt context.
 */
ddi_acc_handle_t
mcxnex_get_pcihdl(mcxnex_state_t *state)
{
	return (state->hs_fm_disable || mcxnex_get_state(state) & HCA_ATTCH_FM ?
	    state->hs_fm_pcihdl : state->hs_reg_pcihdl);
}


