Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
/*
 *  ddi_acc_handle_t
 *  mcxnex_get_msix_tblhdl(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_get_msix_tblhdl() returns either the fma-protected access
 *      handle or the regular ddi-access handle to access the MSI-X tables.
 *      Whether or not which handle is returned at the moment depends on
 *      the Mcxnex FM state.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *  	the access handle to MSI-X tables
 *
 *  Caller's context
 *      mcxnex_get_msix_tblhdl() can be called in user, kernel, interrupt
 *      context or high interrupt context.
 */
ddi_acc_handle_t
mcxnex_get_msix_tblhdl(mcxnex_state_t *state)
{
	return (state->hs_fm_disable || mcxnex_get_state(state) & HCA_ATTCH_FM ?
	    state->hs_fm_msix_tblhdl : state->hs_reg_msix_tblhdl);
}


/*
 *  ddi_acc_handle_t
 *  mcxnex_get_msix_pbahdl(mcxnex_state_t *state)
 *
 *  Overview
 *      mcxnex_get_msix_pbahdl() returns either the fma-protected access
 *      handle or the regular ddi-access handle to access the MSI-X PBA.
 *      Whether or not which handle is returned at the moment depends on
 *      the Mcxnex FM state.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *
 *  Return value
 *  	the access handle to MSI-X PBA
 *
 *  Caller's context
 *      mcxnex_get_msix_pbahdl() can be called in user, kernel, interrupt
 *      context or high interrupt context.
 */
ddi_acc_handle_t
mcxnex_get_msix_pbahdl(mcxnex_state_t *state)
{
	return (state->hs_fm_disable || mcxnex_get_state(state) & HCA_ATTCH_FM ?
	    state->hs_fm_msix_pbahdl : state->hs_reg_msix_pbahdl);
}


/*
 *  void
 *  mcxnex_inter_err_chk(void *arg)
 *
 *  Overview
 *      mcxnex_inter_err_chk() periodically checks the internal error buffer
 *      to pick up a Mcxnex asynchronous internal error.
 *
 *      Note that this internal error can be notified if the interrupt is
 *      registered, but even so there are some cases that an interrupt against
 *      it cannot be raised so that Mcxnex RPM recommeds to poll this internal
 *      error buffer periodically instead. This function is invoked at
 *      10ms interval in kernel context though the function itself can be
 *      called in interrupt context.
 *
 *  Argument
 *      arg: pointer to Mcxnex state structure
 *
 *  Return value
 *  	Nothing
 *
 *  Caller's context
 *      mcxnex_inter_err_chk() can be called in user, kernel, interrupt
 *      context or high interrupt context.
 *
 */
void
mcxnex_inter_err_chk(void *arg)
{
	uint32_t	word;
	ddi_acc_handle_t cmdhdl;
	mcxnex_state_t *state = (mcxnex_state_t *)arg;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

#ifdef FMA_TEST
	if (mcxnex_test_num != 0) {
		return;
	}
#endif
	if (state->hs_fm_poll_suspend) {
		return;
	}

	/* Get the access handle for Mcxnex CMD I/O space */
	cmdhdl = mcxnex_get_cmdhdl(state);

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, cmdhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	word = ddi_get32(cmdhdl, state->hs_cmd_regs.fw_err_buf);

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, cmdhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	if (word != 0) {
		MCXNEX_FMANOTE(state, MCXNEX_FMA_INTERNAL);
		/* if fm_disable is on, FM functions don't work */
		if (state->hs_fm_disable) {
			cmn_err(CE_PANIC,
			    "ConnectX-2 Fatal Internal Error.  state=0x%p",
			    (void *)state);
		} else {
			mcxnex_fm_ereport(state, HCA_IBA_ERR, HCA_ERR_FATAL);
		}
	}

	/* issue the ereport pended in the interrupt context */
	if (state->hs_fm_async_errcnt > 0) {
		mcxnex_fm_ereport(state, HCA_IBA_ERR, HCA_ERR_FATAL);
		atomic_dec_32(&state->hs_fm_async_errcnt);
	}

	return;

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_FATAL);
}


/*
 *  boolean_t
 *  mcxnex_cmd_retry_ok(mcxnex_cmd_post_t *cmd, int status)
 *
 *  Overview
 *  	In the case that a HW error is detected, if it can be isolated
 *  	enough, Mcxnex FM retries the operation which caused the error.
 *  	However, this retry can induce another error; since the retry is
 *  	achieved as a block basis, not a statement basis, once the state
 *  	was set inside the Mcxnex HW already in the previous operation, the
 *  	retry can cause for example, a CMD_BAD_SYS_STATE error, as a result.
 *  	In this case, CMD_BAD_SYS_STATE should be taken as a side effect
 *  	but a harmless result. mcxnex_cmd_retry_ok() checks this kind of
 *  	situation then returns if the state Mcxnex CMD returns is OK or not.
 *
 *  Argument
 *      cmd: pointer to mcxnex_cmd_post_t structure
 *      status: Mcxnex CMD status
 *
 *  Return value
 *  	B_TRUE		this state is no problem
 *  	B_FALSE		this state should be taken as an error
 *
 *  Caller's context
 *      mcxnex_cmd_retry_ok() can be called in user, kernel, interrupt
 *      context or high interrupt context.
 *
 *  Note that status except for MCXNEX_CMD_SUCCESS shouldn't be accepted
 *  in the debug module to catch a hidden software bug, so that ASSERT()
 *  is enabled in the case.
 */
boolean_t
mcxnex_cmd_retry_ok(mcxnex_cmd_post_t *cmd, int status)
{
	if (status == MCXNEX_CMD_SUCCESS)
		return (B_TRUE);

	/*
	 * The wrong status such as MCXNEX_CMD_BAD_SYS_STATE or
	 * MCXNEX_CMD_BAD_RES_STATE can return as a side effect
	 * because of the Mcxnex FM operation retry when a PIO
	 * error is detected during the I/O transaction. In the
	 * case, the driver may set the same value in Mcxnex
	 * though it was set already, then Mcxnex returns MCXNEX_
	 * CMD_BAD_{RES,SYS}_STATE as a result, which should be
	 * taken as OK.
	 */
	switch (cmd->cp_opcode) {
	case INIT_HCA:
		/*
		 * MCXNEX_CMD_BAD_SYS_STATE can be gotten in case of
		 * ICM not mapped or HCA already initialized.
		 */
		if (status == MCXNEX_CMD_BAD_SYS_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case CLOSE_HCA:
		/*
		 * MCXNEX_CMD_BAD_SYS_STATE can be gotten in case of Firmware
		 * area is not mapped or HCA already closed.
		 */
		if (status == MCXNEX_CMD_BAD_SYS_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case CLOSE_PORT:
		/*
		 * MCXNEX_CMD_BAD_SYS_STATE can be gotten in case of HCA not
		 * initialized or in case that IB ports are already down.
		 */
		if (status == MCXNEX_CMD_BAD_SYS_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case SW2HW_MPT:
		/*
		 * MCXNEX_CMD_BAD_RES_STATE can be gotten in case of MPT
		 * entry already in hardware ownership.
		 */
		if (status == MCXNEX_CMD_BAD_RES_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case HW2SW_MPT:
		/*
		 * MCXNEX_CMD_BAD_RES_STATE can be gotten in case of MPT
		 * entry already in software ownership.
		 */
		if (status == MCXNEX_CMD_BAD_RES_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case SW2HW_EQ:
		/*
		 * MCXNEX_CMD_BAD_RES_STATE can be gotten in case of EQ
		 * entry already in hardware ownership.
		 */
		if (status == MCXNEX_CMD_BAD_RES_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case HW2SW_EQ:
		/*
		 * MCXNEX_CMD_BAD_RES_STATE can be gotten in case of EQ
		 * entry already in software ownership.
		 */
		if (status == MCXNEX_CMD_BAD_RES_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case SW2HW_CQ:
		/*
		 * MCXNEX_CMD_BAD_RES_STATE can be gotten in case of CQ
		 * entry already in hardware ownership.
		 */
		if (status == MCXNEX_CMD_BAD_RES_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case HW2SW_CQ:
		/*
		 * MCXNEX_CMD_BAD_RES_STATE can be gotten in case of CQ
		 * entry already in software ownership.
		 */
		if (status == MCXNEX_CMD_BAD_RES_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case SW2HW_SRQ:
		/*
		 * MCXNEX_CMD_BAD_RES_STATE can be gotten in case of SRQ
		 * entry already in hardware ownership.
		 */
		if (status == MCXNEX_CMD_BAD_RES_STATE)
			return (B_TRUE);
		return (B_FALSE);

	case HW2SW_SRQ:
		/*
		 * MCXNEX_CMD_BAD_RES_STATE can be gotten in case of SRQ
		 * entry already in software ownership.
		 */
		if (status == MCXNEX_CMD_BAD_RES_STATE)
			return (B_TRUE);
		return (B_FALSE);
	default:
		break;
	}

	/* other cases */
	return (B_FALSE);
}


#ifdef FMA_TEST

