Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
/*
 * Mcxnex FMA test variables
 */
#define	FMA_TEST_HASHSZ	64
int mcxnex_test_num;			/* predefined testset */

static struct i_hca_fm_test *i_hca_test_register(char *, int, int,
    void (*)(struct i_hca_fm_test *, ddi_fm_error_t *),
    void *, mod_hash_t *, mod_hash_t *, int);
static void i_hca_test_free_item(mod_hash_val_t);
static void i_hca_test_set_item(int, struct i_hca_fm_test *);
static void mcxnex_trigger_pio_error(mcxnex_test_t *, ddi_fm_error_t *);

/*
 * Mcxnex FMA Function Test Interface
 */

/* Attach Errors */

#define	ATTACH_TS	(HCA_TEST_TRANSIENT | HCA_TEST_ATTACH | HCA_TEST_START)
#define	ATTACH_TE	(HCA_TEST_TRANSIENT | HCA_TEST_ATTACH | HCA_TEST_END)

#define	ATTACH_PS	(HCA_TEST_PERSISTENT | HCA_TEST_ATTACH | HCA_TEST_START)
#define	ATTACH_PE	(HCA_TEST_PERSISTENT | HCA_TEST_ATTACH | HCA_TEST_END)

static mcxnex_test_t testset[] = {
/* Initial Value */
{0, 0, 0, NULL, 0, 0, NULL, NULL, NULL},	/* 0 */

/* PIO Transient Errors */
{0, HCA_TEST_PIO, ATTACH_TS, NULL, /* attach/transient/start/propagate */
    HCA_PIO_RETRY_CNT, 0, NULL, NULL, NULL},	/* 1 */
{0, HCA_TEST_PIO, ATTACH_TE, NULL, /* attach/transient/end/propagate */
    HCA_PIO_RETRY_CNT, 0, NULL, NULL, NULL},	/* 2 */

/* PIO Persistent Errors */
{0, HCA_TEST_PIO, ATTACH_PS, NULL, /* attach/persistent/start/propagate */
    0, 0, NULL, NULL, NULL},			/* 3 */
{0, HCA_TEST_PIO, ATTACH_PE, NULL, /* attach/persistent/end/propagate */
    0, 0, NULL, NULL, NULL},			/* 4 */

};


/*
 *  void
 *  mcxnex_trigger_pio_error(mcxnex_test_t *tst, ddi_fm_error_t *derr)
 *
 *  Overview
 *      mcxnex_trigger_pio_error() is a PIO error injection function
 *      to cause a pseduo PIO error.
 *
 *  Argument
 *      tst: pointer to HCA FM function test structure. If the structure
 *           is not used, the NULL value must be passed instead.
 *      derr: pointer to ddi_fm_error_t structure
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      mcxnex_trigger_pio_error() can be called in user, kernel, interrupt
 *      context or high interrupt context.
 */
static void
mcxnex_trigger_pio_error(mcxnex_test_t *tst, ddi_fm_error_t *derr)
{
	mcxnex_state_t *state = (mcxnex_state_t *)tst->private;
	derr->fme_status = DDI_FM_OK;

	if (tst->type != HCA_TEST_PIO) {
		return;
	}

	if ((tst->trigger & HCA_TEST_ATTACH &&
	    i_ddi_node_state(state->hs_dip) < DS_ATTACHED &&
	    mcxnex_get_state(state) & HCA_PIO_FM)) {
		if (tst->trigger & HCA_TEST_PERSISTENT) {
			i_hca_fm_ereport(state->hs_dip, HCA_IBA_ERR,
			    DDI_FM_DEVICE_INVAL_STATE);
			derr->fme_status = DDI_FM_NONFATAL;
			return;
		} else if (tst->trigger & HCA_TEST_TRANSIENT &&
		    tst->errcnt) {
			i_hca_fm_ereport(state->hs_dip, HCA_IBA_ERR,
			    DDI_FM_DEVICE_INVAL_STATE);
			derr->fme_status = DDI_FM_NONFATAL;
			tst->errcnt--;
			return;
		}
	}
}


/*
 *  struct mcxnex_fm_test *
 *  mcxnex_test_register(mcxnex_state_t *state, char *filename, int linenum,
 *      int type)
 *
 *  Overview
 *      mcxnex_test_register() registers a Mcxnex FM test item for the
 *      function test.
 *
 *  Argument
 *      state: pointer to Mcxnex state structure
 *  	filename: source file name where the function call is implemented
 *		  This value is usually a __FILE__  pre-defined macro.
 *  	linenum: line number where the function call is described in the
 *		 file specified above.
 *		 This value is usually a __LINE__ pre-defined macro.
 *	type: HW error type
 *			HCA_TEST_PIO	pio error
 *			HCA_TEST_IBA	ib specific error
 *
 *  Return value
 *      pointer to Mcxnex FM function test structure registered.
 *
 *  Caller's context
 *      mcxnex_test_register() can be called in user, kernel or interrupt
 *      context.
 *
 *  Note that no test item is registered if Mcxnex FM is disabled.
 */
mcxnex_test_t *
mcxnex_test_register(mcxnex_state_t *state, char *filename, int linenum,
    int type)
{
	void (*pio_injection)(struct i_hca_fm_test *, ddi_fm_error_t *) =
	    (void (*)(struct i_hca_fm_test *, ddi_fm_error_t *))
	    mcxnex_trigger_pio_error;

	if (state->hs_fm_disable)
		return (NULL);

	return ((mcxnex_test_t *)i_hca_test_register(filename, linenum, type,
	    pio_injection, (void *)state, state->hs_fm_test_hash,
	    state->hs_fm_id_hash, mcxnex_test_num));
}
#endif /* FMA_TEST */


/*
 * HCA FM Common Interface
 *
 * These functions should be used for any HCA drivers, but probably
 * customized for their own HW design and/or FM implementation.
 * Customized functions should have the driver name prefix such as
 * mcxnex_xxxx() and be defined separately but whose functions should
 * call the common interface inside.
 */

/*
 *  void
 *  i_hca_fm_init(struct i_hca_fm *hca_fm)
 *
 *  Overview
 *      i_hca_fm_init() is an initialization function which sets up the acc
 *      handle kmem_cache if this function is called the first time.
 *
 *  Argument
 *      hca_fm: pointer to HCA FM structure
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      i_hca_fm_init() can be called in user or kernel context, but cannot
 *      be called in interrupt context.
 */
static void
i_hca_fm_init(struct i_hca_fm *hca_fm)
{

	mutex_enter(&hca_fm->lock);

	++hca_fm->ref_cnt;
	if (hca_fm->fm_acc_cache == NULL) {
		hca_fm->fm_acc_cache = kmem_cache_create("hca_fm_acc_handle",
		    sizeof (struct i_hca_acc_handle), 0, NULL,
		    NULL, NULL, NULL, NULL, 0);
	}

	mutex_exit(&hca_fm->lock);
}


/*
 *  void
 *  i_hca_fm_fini(struct i_hca_fm *hca_fm)
 *
 *  Overview
 *      i_hca_fm_fini() is a finalization function which frees up the acc
 *      handle kmem_cache if this function is called the last time.
 *
 *  Argument
 *      hca_fm: pointer to HCA FM structure
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      i_hca_fm_fini() can be called in user or kernel context, but cannot
 *      be called in interrupt context.
 */
static void
i_hca_fm_fini(struct i_hca_fm *hca_fm)
{
	mutex_enter(&hca_fm->lock);

	if (--hca_fm->ref_cnt == 0) {

		if (hca_fm->fm_acc_cache) {
			kmem_cache_destroy(hca_fm->fm_acc_cache);
			hca_fm->fm_acc_cache = NULL;
		}
	}

	mutex_exit(&hca_fm->lock);
}


