Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
/*
 *  void
 *  i_hca_fm_ereport(dev_info_t *dip, int type, char *detail)
 *
 *  Overview
 *      i_hca_fm_ereport() is a wrapper function of ddi_fm_ereport_post() but
 *      generates an ena before it calls ddi_fm_ereport_post() for HCA
 *      specific HW errors.
 *
 *  Argument
 *      dip: pointer to this device dev_info structure
 *      type: error type
 *		HCA_SYS_ERR	FMA reporting HW error
 *		HCA_IBA_ERR	HCA specific HW error
 *      detail: definition of leaf driver detected ereports which is one of:
 *      	DDI_FM_DEVICE_INVAL_STATE
 *		DDI_FM_DEVICE_NO_RESPONSE
 *		DDI_FM_DEVICE_STALL
 *		DDI_FM_DEVICE_BADINT_LIMIT
 *		DDI_FM_DEVICE_INTERN_CORR
 *		DDI_FM_DEVICE_INTERN_UNCORR
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      i_hca_fm_ereport() can be called in user, kernel or interrupt context.
 */
static void
i_hca_fm_ereport(dev_info_t *dip, int type, char *detail)
{
	uint64_t ena;
	char buf[FM_MAX_CLASS];

	(void) snprintf(buf, FM_MAX_CLASS, "%s.%s", DDI_FM_DEVICE, detail);

	ena = fm_ena_generate(0, FM_ENA_FMT1);
	if (type == HCA_IBA_ERR) {
		/* this is an error of its own */
		ena = fm_ena_increment(ena);
	}

	ddi_fm_ereport_post(dip, buf, ena, DDI_NOSLEEP,
	    FM_VERSION, DATA_TYPE_UINT8, FM_EREPORT_VERS0, NULL);
}


/*
 * struct i_hca_acc_handle *
 * i_hca_get_acc_handle(struct i_hca_fm *hca_fm, ddi_acc_handle_t handle)
 *
 *  Overview
 *      i_hca_get_acc_handle() returns ddi_acc_handle_t used for HCA FM.
 *
 *  Argument
 *      hca_fm: pointer to HCA FM structure
 *      handle: ddi_acc_handle_t
 *
 *  Return value
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *
 *  Caller's context
 *      i_hca_get_acc_handle() can be called in user, kernel or interrupt
 *      context.
 */
static struct i_hca_acc_handle *
i_hca_get_acc_handle(struct i_hca_fm *hca_fm, ddi_acc_handle_t handle)
{
	struct i_hca_acc_handle *hdlp;

	/* Retrieve the HCA FM access handle */
	mutex_enter(&hca_fm->lock);

	for (hdlp = hca_fm->hdl; hdlp != NULL; hdlp = hdlp->next) {
		if (hdlp->save_hdl == handle) {
			mutex_exit(&hca_fm->lock);
			return (hdlp);
		}
	}

	mutex_exit(&hca_fm->lock);
	return (hdlp);
}


/*
 *  int
 *  i_hca_regs_map_setup(struct i_hca_fm *hca_fm, dev_info_t *dip,
 *      uint_t rnumber, caddr_t *addrp, offset_t offset, offset_t len,
 *      ddi_device_acc_attr_t *accattrp, ddi_acc_handle_t *handle)
 *
 *  Overview
 *      i_hca_regs_map_setup() is a wrapper function of ddi_regs_map_setup(),
 *      but allocates the HCA FM acc handle structure and initializes it.
 *
 *  Argument
 *      hca_fm: pointer to HCA FM structure
 *      dip: pointer to this device dev_info structure
 *      rnumber: index number to the register address space set
 *      addrp: platform-dependent value (same as ddi_regs_map_setup())
 *      offset: offset into the register address space
 *      len: address space length to be mapped
 *      accattrp: pointer to device access attribute structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *
 *  Return value
 *      ddi function status value which are:
 *      	DDI_SUCCESS
 *      	DDI_FAILURE
 *      	DDI_ME_RNUMBER_RNGE
 *      	DDI_REGS_ACC_CONFLICT
 *
 *  Caller's context
 *      i_hca_regs_map_setup() can be called in user or kernel context only.
 */
static int
i_hca_regs_map_setup(struct i_hca_fm *hca_fm, dev_info_t *dip, uint_t rnumber,
    caddr_t *addrp, offset_t offset, offset_t len,
    ddi_device_acc_attr_t *accattrp, ddi_acc_handle_t *handle)
{
	int status;
	struct i_hca_acc_handle *handlep, *hdlp, *last;

	/* Allocate an access handle */
	if ((status = ddi_regs_map_setup(dip, rnumber, addrp, offset,
	    len, accattrp, handle)) != DDI_SUCCESS) {
		return (status);
	}

	/* Allocate HCA FM acc handle structure */
	handlep = kmem_cache_alloc(hca_fm->fm_acc_cache, KM_SLEEP);

	/* Initialize fields */
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*handlep))
	handlep->next = NULL;
	handlep->save_hdl = (*handle);
	handlep->thread_cnt = 0;
	mutex_init(&handlep->lock, NULL, MUTEX_DRIVER, NULL);

	/* Register this handle */
	mutex_enter(&hca_fm->lock);
	for (last = hdlp = hca_fm->hdl; hdlp != NULL; hdlp = hdlp->next) {
		last = hdlp;
	}
	if (last == NULL) {
		hca_fm->hdl = handlep;
	} else {
		last->next = handlep;
	}
	mutex_exit(&hca_fm->lock);

	return (status);
}


/*
 *  void
 *  i_hca_regs_map_free(struct i_hca_fm *hca_fm, ddi_acc_handle_t *handlep)
 *
 *  Overview
 *      i_hca_regs_map_setup() is a wrapper function of ddi_regs_map_free(),
 *      and frees the HCA FM acc handle structure allocated by
 *      i_hca_regs_map_setup().
 *
 *  Argument
 *      hca_fm: pointer to HCA FM structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      i_hca_regs_map_free() can be called in user or kernel context only.
 *
 *  Note that the handle passed to i_hca_regs_map_free() is NULL-cleared
 *  after this function is called.
 */
static void
i_hca_regs_map_free(struct i_hca_fm *hca_fm, ddi_acc_handle_t *handle)
{
	struct i_hca_acc_handle *handlep, *hdlp, *prev;

	/* De-register this handle */
	mutex_enter(&hca_fm->lock);
	for (prev = hdlp = hca_fm->hdl; hdlp != NULL; hdlp = hdlp->next) {
		if (hdlp->save_hdl == *handle)
			break;
		prev = hdlp;
	}
	ASSERT(prev != NULL && hdlp != NULL);
	if (hdlp != prev) {
		prev->next = hdlp->next;
	} else {
		hca_fm->hdl = hdlp->next;
	}
	handlep = hdlp;
	mutex_exit(&hca_fm->lock);

	mutex_destroy(&handlep->lock);
	handlep->save_hdl = NULL;
	kmem_cache_free(hca_fm->fm_acc_cache, handlep);

	/* Release this handle */
	ddi_regs_map_free(handle);
	*handle = NULL;
}


/*
 *  int
 *  i_hca_pci_config_setup(struct i_hca_fm *hca_fm, dev_info_t *dip,
 *      ddi_acc_handle_t *handle, boolean_t fm_protect)
 *
 *  Overview
 *      i_hca_pci_config_setup() is a wrapper function of pci_config_setup(),
 *      but allocates the HCA FM acc handle structure and initializes it.
 *
 *  Argument
 *      hca_fm: pointer to HCA FM structure
 *      dip: pointer to this device dev_info structure
 *	handle: pointer to ddi_acc_handle_t used for HCA PCI config space
 *		with FMA
 *	fm_protect: flag to tell if an fma-protected access handle should
 *		be used
 *
 *  Return value
 *      ddi function status value which are:
 *      	DDI_SUCCESS
 *      	DDI_FAILURE
 *
 *  Caller's context
 *      i_hca_pci_config_setup() can be called in user or kernel context only.
 */
static int
i_hca_pci_config_setup(struct i_hca_fm *hca_fm, dev_info_t *dip,
    ddi_acc_handle_t *handle)
{
	int status;
	struct i_hca_acc_handle *handlep, *hdlp, *last;

	/* Allocate an access handle */
	if ((status = pci_config_setup(dip, handle)) != DDI_SUCCESS) {
		return (status);
	}

	/* Allocate HCA FM acc handle structure */
	handlep = kmem_cache_alloc(hca_fm->fm_acc_cache, KM_SLEEP);

	/* Initialize fields */
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*handlep))
	handlep->next = NULL;
	handlep->save_hdl = (*handle);
	handlep->thread_cnt = 0;
	mutex_init(&handlep->lock, NULL, MUTEX_DRIVER, NULL);

