Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
	/* Register this handle */
	mutex_enter(&hca_fm->lock);
	for (last = hdlp = hca_fm->hdl; hdlp != NULL; hdlp = hdlp->next) {
		last = hdlp;
	}
	if (last == NULL) {
		hca_fm->hdl = handlep;
	} else {
		last->next = handlep;
	}
	mutex_exit(&hca_fm->lock);

	return (status);
}


/*
 *  void
 *  i_hca_pci_config_teardown(struct i_hca_fm *hca_fm,
 *      ddi_acc_handle_t *handlep)
 *
 *  Overview
 *      i_hca_pci_config_teardown() is a wrapper function of
 *      pci_config_teardown(), and frees the HCA FM acc handle structure
 *      allocated by i_hca_pci_config_setup().
 *
 *  Argument
 *      hca_fm: pointer to HCA FM structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      i_hca_pci_config_teardown() can be called in user or kernel context
 *      only.
 *
 *  Note that the handle passed to i_hca_pci_config_teardown() is NULL-cleared
 *  after this function is called.
 */
static void
i_hca_pci_config_teardown(struct i_hca_fm *hca_fm, ddi_acc_handle_t *handle)
{
	struct i_hca_acc_handle *handlep, *hdlp, *prev;

	/* De-register this handle */
	mutex_enter(&hca_fm->lock);
	for (prev = hdlp = hca_fm->hdl; hdlp != NULL; hdlp = hdlp->next) {
		if (hdlp->save_hdl == *handle)
			break;
		prev = hdlp;
	}
	ASSERT(prev != NULL && hdlp != NULL);
	if (hdlp != prev) {
		prev->next = hdlp->next;
	} else {
		hca_fm->hdl = hdlp->next;
	}
	handlep = hdlp;
	mutex_exit(&hca_fm->lock);

	mutex_destroy(&handlep->lock);
	handlep->save_hdl = NULL;
	kmem_cache_free(hca_fm->fm_acc_cache, handlep);

	/* Release this handle */
	pci_config_teardown(handle);
	*handle = NULL;
}


/*
 *  int
 *  i_hca_pio_start(dev_info_t *dip, struct i_acc_handle *handle,
 *      struct i_hca_fm_test *tst)
 *
 *  Overview
 *      i_hca_pio_start() is one of a pair of HCA FM fuctions for PIO, which
 *      should be called before HCA drivers issue PIOs against I/O space.
 *      See HCA FM comments at the beginning of this file in detail.
 *
 *  Argument
 *      dip: pointer to this device dev_info structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *      tst: pointer to HCA FM function test structure. If the structure
 *           is not used, the NULL value must be passed instead.
 *
 *  Return value
 *  	error status showing whether or not this error can retry
 *	HCA_PIO_OK		No HW errors
 *	HCA_PIO_TRANSIENT	This error could be transient
 *	HCA_PIO_PERSISTENT	This error is persistent
 *
 *  Caller's context
 *      i_hca_pio_start() can be called in user, kernel or interrupt context.
 */
/* ARGSUSED */
static int
i_hca_pio_start(dev_info_t *dip, struct i_hca_acc_handle *hdlp,
    struct i_hca_fm_test *tst)
{
	ddi_fm_error_t derr;

	/* Count up the number of threads issuing this PIO */
	mutex_enter(&hdlp->lock);
	hdlp->thread_cnt++;
	mutex_exit(&hdlp->lock);

	/* Get the PIO error via FMA */
	ddi_fm_acc_err_get(fm_acc_hdl(hdlp), &derr, DDI_FME_VERSION);

#ifdef FMA_TEST
	/* Trigger PIO errors */
	if (tst != NULL && tst->trigger & HCA_TEST_START) {
		(*tst->pio_injection)(tst, &derr);
	}
#endif /* FMA_TEST */

	switch (derr.fme_status) {
	case DDI_FM_OK:
		/* Not have to clear the fma error log */
		return (HCA_PIO_OK);

	case DDI_FM_NONFATAL:
		/* Now clear this error */
		ddi_fm_acc_err_clear(fm_acc_hdl(hdlp), DDI_FME_VERSION);

		/* Log this error and notify it as a persistent error */
		ddi_fm_service_impact(dip, DDI_SERVICE_LOST);
		return (HCA_PIO_PERSISTENT);

	/* In theory, this shouldn't happen */
	case DDI_FM_FATAL:
	case DDI_FM_UNKNOWN:
	default:
		cmn_err(CE_WARN, "Unknown HCA HW error status (%d)",
		    derr.fme_status);
		/* Return this as a persistent error */
		return (HCA_PIO_PERSISTENT);
	}
}


/*
 *  int
 *  i_hca_pio_end(dev_info_t *dip, ddi_acc_handle_t handle, int *cnt,
 *      struct i_hca_fm_test *tst)
 *
 *  Overview
 *      i_hca_pio_end() is the other of a pair of HCA FM fuctions for PIO,
 *      which should be called after HCA drivers issue PIOs against I/O space.
 *      See HCA FM comments at the beginning of this file in detail.
 *
 *  Argument
 *      dip: pointer to this device dev_info structure
 *	handle: pointer to ddi_acc_handle_t used for HCA FM
 *	cnt: pointer to the counter variable which holds the nubmer of retry
 *	     when a HW error is detected.
 *      tst: pointer to HCA FM function test structure. If the structure
 *           is not used, the NULL value must be passed instead.
 *
 *  Return value
 *  	error status showing whether or not this error can retry
 *	HCA_PIO_OK		No HW errors
 *	HCA_PIO_TRANSIENT	This error could be transient
 *	HCA_PIO_PERSISTENT	This error is persistent
 *
 *  Caller's context
 *      i_hca_pio_end() can be called in user, kernel or interrupt context.
 */
/* ARGSUSED */
static int
i_hca_pio_end(dev_info_t *dip, struct i_hca_acc_handle *hdlp, int *cnt,
    struct i_hca_fm_test *tst)
{
	ddi_fm_error_t derr;

	/* Get the PIO error via FMA */
	ddi_fm_acc_err_get(fm_acc_hdl(hdlp), &derr, DDI_FME_VERSION);

#ifdef FMA_TEST
	/* Trigger PIO errors */
	if (tst != NULL && tst->trigger & HCA_TEST_END) {
		(*tst->pio_injection)(tst, &derr);
	}
#endif /* FMA_TEST */

	/* Evaluate the PIO error */
	switch (derr.fme_status) {
	case DDI_FM_OK:
		/* Count down the number of threads issuing this PIO */
		mutex_enter(&hdlp->lock);
		hdlp->thread_cnt--;
		mutex_exit(&hdlp->lock);

		/* Not have to clear the fma error log */
		return (HCA_PIO_OK);

	case DDI_FM_NONFATAL:
		/* Now clear this error */
		ddi_fm_acc_err_clear(fm_acc_hdl(hdlp), DDI_FME_VERSION);

		/*
		 * Check if this error comes from another thread running
		 * with the same handle almost at the same time.
		 */
		mutex_enter(&hdlp->lock);
		if (hdlp->thread_cnt > 1) {
			/* Count down the number of threads */
			hdlp->thread_cnt--;
			mutex_exit(&hdlp->lock);

			/* Return this as a persistent error */
			return (HCA_PIO_PERSISTENT);
		}
		mutex_exit(&hdlp->lock);

		/* Now determine if this error is persistent or not */
		if (--(*cnt) >= 0)  {
			return (HCA_PIO_TRANSIENT);
		} else {
			/* Count down the number of threads */
			mutex_enter(&hdlp->lock);
			hdlp->thread_cnt--;
			mutex_exit(&hdlp->lock);
			return (HCA_PIO_PERSISTENT);
		}

	/* In theory, this shouldn't happen */
	case DDI_FM_FATAL:
	case DDI_FM_UNKNOWN:
	default:
		cmn_err(CE_WARN, "Unknown HCA HW error status (%d)",
		    derr.fme_status);
		/* Return this as a persistent error */
		return (HCA_PIO_PERSISTENT);
	}
}


