Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_fm.c
/*
 * HCA FM Test Interface
 *
 * These functions should be used for any HCA drivers, but probably
 * customized for their own HW design and/or FM implementation.
 * Customized functins should have the driver name prefix such as
 * mcxnex_xxxx() and be defined separately but whose function should
 * call the common interface inside.
 */

#ifdef FMA_TEST
static int test_num;		/* serial number */
static kmutex_t i_hca_test_lock; 	/* lock for serial numer */

/*
 *  void
 *  i_hca_test_init(mod_hash_t **strHashp, mod_hash_t **idHashp)
 *
 *  Overview
 *      i_hca_test_init() creates two hash tables, one of which is for string,
 *      and the other of which is for ID, then saves pointers to arguments
 *      passed. This function uses the mod_hash utilities to manage the
 *      hash tables. About the mod_hash, see common/os/modhash.c.
 *
 *  Argument
 *      strHashp: pointer to String hash table pointer
 *      idHashp: pointer to ID hash table pointer
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      i_hca_test_init() can be called in user or kernel context only.
 */
static void
i_hca_test_init(mod_hash_t **strHashp, mod_hash_t **idHashp)
{
	*idHashp = mod_hash_create_idhash("HCA_FMA_id_hash",
	    FMA_TEST_HASHSZ, mod_hash_null_valdtor);

	*strHashp = mod_hash_create_strhash("HCA_FMA_test_hash",
	    FMA_TEST_HASHSZ, i_hca_test_free_item);
}


/*
 *  void
 *  i_hca_test_fini(mod_hash_t **strHashp, mod_hash_t **idHashp)
 *
 *  Overview
 *      i_hca_test_fini() releases two hash tables used for HCA FM test.
 *
 *  Argument
 *      strHashp: pointer to String hash table pointer
 *      idHashp: pointer to ID hash table pointer
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      i_hca_test_fini() can be called in user, kernel or interrupt context.
 *
 */
static void
i_hca_test_fini(mod_hash_t **strHashp, mod_hash_t **idHashp)
{
	mod_hash_destroy_hash(*strHashp);
	*strHashp = NULL;

	mod_hash_destroy_hash(*idHashp);
	*idHashp = NULL;
}


/*
 *  struct i_hca_fm_test *
 *  i_hca_test_register(char *filename, int linenum, int type,
 *      void (*pio_injection)(struct i_hca_fm_test *, ddi_fm_error_t *),
 *      void *private, mod_hash_t *strHash, mod_hash_t *idHash, int preTestNum)
 *
 *  Overview
 *      i_hca_test_register() registers an HCA FM test item against HCA FM
 *      function callings specified with the file name and the line number
 *      (passed as the arguments).
 *
 *  Argument
 *  	filename: source file name where the function call is implemented
 *		  This value is usually a __FILE__  pre-defined macro.
 *  	linenum: line number where the function call is described in the
 *		 file specified above.
 *		 This value is usually a __LINE__ pre-defined macro.
 *	type: HW error type
 *			HCA_TEST_PIO	pio error
 *			HCA_TEST_IBA	ib specific error
 *	pio_injection: pio error injection callback function invoked when the
 *		       function specified above (with the file name and the
 *		       line number) is executed. If the function is not a PIO,
 *		       request, this parameter should be NULL.
 *	private: the argument passed to either of injection functions when
 *		 they're invoked.
 *      strHashp: pointer to String hash table
 *      idHashp: pointer to ID hash table
 *      preTestNum: the index of the pre-defined testset for this test item.
 *
 *  Return value
 *      pointer to HCA FM function test structure registered.
 *
 *  Caller's context
 *      i_hca_test_register() can be called in user, kernel or interrupt
 *      context.
 *
 */
static struct i_hca_fm_test *
i_hca_test_register(char *filename, int linenum, int type,
    void (*pio_injection)(struct i_hca_fm_test *, ddi_fm_error_t *),
    void *private, mod_hash_t *strHash, mod_hash_t *idHash, int preTestNum)
{
	struct i_hca_fm_test *t_item;
	char key_buf[255], *hash_key;
	int status;

	(void) sprintf(key_buf, "%s:%d", filename, linenum);
	hash_key = kmem_zalloc(strlen(key_buf) + 1, KM_NOSLEEP);

	if (hash_key == NULL)
		cmn_err(CE_PANIC, "No memory for HCA FMA Test.");

	bcopy(key_buf, hash_key, strlen(key_buf));

	status = mod_hash_find(strHash, (mod_hash_key_t)hash_key,
	    (mod_hash_val_t *)&t_item);

	switch (status) {
	case MH_ERR_NOTFOUND:
		t_item = (struct i_hca_fm_test *)
		    kmem_alloc(sizeof (struct i_hca_fm_test), KM_NOSLEEP);
		if (t_item == NULL)
			cmn_err(CE_PANIC, "No memory for HCA FMA Test.");

		/* Set the error number */
		mutex_enter(&i_hca_test_lock);
		t_item->num = test_num++;
		mutex_exit(&i_hca_test_lock);

		/* Set type and other static information */
		t_item->type = type;
		t_item->line_num = linenum;
		t_item->file_name = filename;
		t_item->hash_key = hash_key;
		t_item->private = private;
		t_item->pio_injection = pio_injection;

		/* Set the pre-defined mcxnex test item */
		i_hca_test_set_item(preTestNum, (struct i_hca_fm_test *)t_item);

		status = mod_hash_insert(strHash, (mod_hash_key_t)
		    hash_key, (mod_hash_val_t)t_item);
		ASSERT(status == 0);

		status = mod_hash_insert(idHash, (mod_hash_key_t)
		    (uintptr_t)t_item->num, (mod_hash_val_t)t_item);
		ASSERT(status == 0);
		break;

	case MH_ERR_NOMEM:
		cmn_err(CE_PANIC, "No memory for HCA FMA Test.");
		break;

	case MH_ERR_DUPLICATE:
		cmn_err(CE_PANIC, "HCA FMA Test Internal Error.");
		break;
	default:
		/* OK, this is already registered. */
		kmem_free(hash_key, strlen(key_buf) + 1);
		break;
	}
	return (t_item);
}


/*
 *  void
 *  i_hca_test_set_item(int num, struct i_hca_fm_test *t_item)
 *
 *  Overview
 *      i_hca_test_set_item() is a private function used in
 *      i_hca_test_register() above. This function sets the testset specified
 *      (with the index number) to HCA FM function test structure.
 *
 *  Argument
 *      num: index to test set (testset structure array)
 *      t_item: pointer to HCA fM function test structure
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      i_hca_test_set_item() can be called in user, kernel, interrupt
 *      context or hight interrupt context.
 *
 */
static void
i_hca_test_set_item(int num, struct i_hca_fm_test *t_item)
{
	if (num < 0 || num >= sizeof (testset) / sizeof (mcxnex_test_t) ||
	    testset[num].type != t_item->type) {
		t_item->trigger = testset[0].trigger;
		t_item->errcnt = testset[0].errcnt;
		return;
	}

	/* Set the testsuite */
	t_item->trigger = testset[num].trigger;
	t_item->errcnt = testset[num].errcnt;
}


/*
 *  void
 *  i_hca_test_free_item(mod_hash_val_t val)
 *
 *  Overview
 *      i_hca_test_free_item() is a private function used to free HCA FM
 *      function test structure when i_hca_test_fini() is called. This function
 *      is registered as a destructor when the hash table is created in
 *      i_hca_test_init().
 *
 *  Argument
 *      val: pointer to the value stored in hash table (pointer to HCA FM
 *           function test structure)
 *
 *  Return value
 *      Nothing
 *
 *  Caller's context
 *      i_hca_test_free_item() can be called in user, kernel or interrupt
 *      context.
 *
 */
static void
i_hca_test_free_item(mod_hash_val_t val)
{
	struct i_hca_fm_test *t_item = (struct i_hca_fm_test *)val;
	kmem_free(t_item, sizeof (struct i_hca_fm_test));
}
#endif /* FMA_TEST */
